{
    "javascript": "это язык программирования, который встроен в код страницы и выполняется браузером на локальном компьютере пользователя. Используя различные операторы и функции, Javascript позволяет манипулировать элементами разметки и ее стилями",
    
    "node-js": "программная платформа, основанная на движке V8 (транслирующем JavaScript в машинный код), превращающая JavaScript из узкоспециализированного языка в язык общего назначения",
    
    "ооп": "Объектно-ориентированное программирования –  методология программирования, основанная на представлении программы в виде совокупности объектов.",

    "фреймворк": "Пэто рабочая среда, которая помогает разработчику быстро и качественно создавать программный продукт, не отвлекаясь на мелочи.",

    "библиотека": " сборник подпрограмм или объектов, используемых для разработки программного обеспечения (ПО)",

    "react": "это JavaScript библиотека для построения пользовательских интерфейсов.",

    "angular": "JavaScript-фреймворк с открытым исходным кодом. Предназначен для разработки одностраничных приложений.",

    "npm": "это менеджер пакетов, который входит в состав Node.js. В течение многих лет Node широко использовался разработчиками JavaScript для обмена инструментами",

    "api": "Application programming interface – это набор команд, функций, протоколов и объектов, которые программисты могут использовать для создания программного обеспечения или взаимодействия с внешней системой.",

    "прототип": "Специальный объект или механизм, с помощью которого объекты JavaScript наследуют свойства друг от друга.",
    
    "объект": "Структура данных, которая состоит из набора свойств и методов.",

    "mvc": "model-view-controller - то способ организации кода, который предполагает выделение блоков, отвечающих за решение разных задач.",
    
    "state": "это обычные JavaScript-объекты. Несмотря на то, что оба содержат информацию, которая влияет на то, что увидим после рендера, есть существенное различие",

    "props": "представляет коллекцию значений, которые ассоциированы с компонентом. Эти значения позволяют создавать динамические компоненты, которые не зависят от жестко закодированных статических данных"

}
